### Importing Libraries ###

In [1]:
import pandas as pd

### Exploring DataSet ###

In [2]:
df = pd.read_csv(r"F:\Python codes\machine-learning Practices\customer_dataset.csv")

In [3]:
df

,customer_name,customer_id,gender,age,location,usage_history,subscription_status,churn
0,Customer_164,1035.0,Other,65.0,London,389.915068,Inactive,0.0
1,Customer_29,1005.0,Female,31.0,Berlin,107.159294,NaN,0.0
2,Customer_7,1006.0,Female,55.0,London,110.675539,Cancelled,0.0
3,Customer_190,1070.0,Other,22.0,Berlin,112.556020,Active,0.0
4,Customer_71,1037.0,Other,20.0,Tokyo,103.365493,NaN,1.0
...,...,...,...,...,...,...,...,...
1015,NaN,1095.0,Female,34.0,Tokyo,349.224866,Cancelled,1.0
1016,NaN,1029.0,Female,51.0,NaN,477.880715,Active,1.0
1017,NaN,1021.0,Other,66.0,New York,465.342496,Cancelled,1.0
1018,NaN,1084.0,Male,54.0,New York,445.398836,Inactive,1.0
1019,NaN,1010.0,Other,36.0,Sydney,274.549395,Inactive,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1020 entries, 0 to 1019
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   customer_name        950 non-null    object
 1   customer_id          969 non-null    float64
 2   gender               969 non-null    object
 3   age                  970 non-null    float64
 4   location             969 non-null    object
 5   usage_history        969 non-null    float64
 6   subscription_status  968 non-null    object
 7   churn                967 non-null    float64
dtypes: float64(4), object(4)
memory usage: 63.9+ KB

### Handling MissingValues ###

### before handling missing values ###

In [5]:
df.isnull().sum()

customer_name          70
customer_id            51
gender                 51
age                    50
location               51
usage_history          51
subscription_status    52
churn                  53
dtype: int64

In [6]:
df.dropna(subset=["customer_id"], inplace=True)
df.reset_index(drop=True, inplace=True)

In [7]:
df.dropna(subset=["customer_name"], inplace=True)
df.reset_index(drop=True, inplace=True)

In [8]:
df["gender"].value_counts()

gender
Other     303
Female    297
Male      257
Name: count, dtype: int64

In [9]:
df["gender"].fillna(df["gender"].mode()[0] , inplace=True)

C:\Users\Bs\AppData\Local\Temp\ipykernel_3436\849631907.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["gender"].fillna(df["gender"].mode()[0] , inplace=True)

In [10]:
df['age'].fillna(df['age'].mean(), inplace=True)

C:\Users\Bs\AppData\Local\Temp\ipykernel_3436\1503503937.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].mean(), inplace=True)

In [11]:
df['location'].value_counts()

location
New York    164
London      150
Tokyo       142
Toronto     137
Berlin      131
Sydney      130
Name: count, dtype: int64

In [12]:
df['location'].fillna(df['location'].mode()[0] , inplace=True)

C:\Users\Bs\AppData\Local\Temp\ipykernel_3436\4195681336.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['location'].fillna(df['location'].mode()[0] , inplace=True)

In [13]:
df.dropna(subset=["churn" , "subscription_status" , "usage_history"], inplace=True)

In [14]:
df.isnull().sum()

customer_name          0
customer_id            0
gender                 0
age                    0
location               0
usage_history          0
subscription_status    0
churn                  0
dtype: int64

### Checking for duplicates ###

In [15]:
df.duplicated().sum()

np.int64(0)

### Encoding Categorical variables ###

In [16]:
df['gender'] = df['gender'].map({"Other" : 0 , "Male" : 1 , "Female" : 2})

In [17]:
df = pd.get_dummies(df, columns=["location"], drop_first=True)

In [18]:
df['subscription_status'].value_counts()

subscription_status
Cancelled    273
Inactive     251
Active       245
Name: count, dtype: int64

In [19]:
df = pd.get_dummies(df, columns=["subscription_status"], prefix="status")

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 769 entries, 0 to 901
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_name      769 non-null    object
 1   customer_id        769 non-null    float64
 2   gender             769 non-null    int64
 3   age                769 non-null    float64
 4   usage_history      769 non-null    float64
 5   churn              769 non-null    float64
 6   location_London    769 non-null    bool
 7   location_New York  769 non-null    bool
 8   location_Sydney    769 non-null    bool
 9   location_Tokyo     769 non-null    bool
 10  location_Toronto   769 non-null    bool
 11  status_Active      769 non-null    bool
 12  status_Cancelled   769 non-null    bool
 13  status_Inactive    769 non-null    bool
dtypes: bool(8), float64(4), int64(1), object(1)
memory usage: 48.1+ KB

In [21]:
df.head()

,customer_name,customer_id,gender,age,usage_history,churn,location_London,location_New York,location_Sydney,location_Tokyo,location_Toronto,status_Active,status_Cancelled,status_Inactive
0,Customer_164,1035.0,0,65.0,389.915068,0.0,True,False,False,False,False,False,False,True
2,Customer_7,1006.0,2,55.0,110.675539,0.0,True,False,False,False,False,False,True,False
3,Customer_190,1070.0,0,22.0,112.556020,0.0,False,False,False,False,False,True,False,False
5,Customer_63,1089.0,0,45.0,325.793666,1.0,False,False,False,True,False,False,False,True
7,Customer_36,1081.0,2,62.0,432.314965,1.0,False,False,False,True,False,False,True,False

### Normalizing Numeric Features ###

In [22]:
from sklearn.preprocessing import MinMaxScaler

In [23]:
numeric_columns = ["age" , "usage_history"]
scalar = MinMaxScaler()

In [24]:
# Normalize and assign each numeric column separately
df[numeric_columns] = scalar.fit_transform(df[numeric_columns])

In [25]:
# Convert only bool columns to int
bool_cols = df.select_dtypes(include=bool).columns
df[bool_cols] = df[bool_cols].astype(int)

In [26]:
df.head()

,customer_name,customer_id,gender,age,usage_history,churn,location_London,location_New York,location_Sydney,location_Tokyo,location_Toronto,status_Active,status_Cancelled,status_Inactive
0,Customer_164,1035.0,0,0.903846,0.782591,0.0,1,0,0,0,0,0,0,1
2,Customer_7,1006.0,2,0.711538,0.221271,0.0,1,0,0,0,0,0,1,0
3,Customer_190,1070.0,0,0.076923,0.225051,0.0,0,0,0,0,0,1,0,0
5,Customer_63,1089.0,0,0.519231,0.653696,1.0,0,0,0,1,0,0,0,1
7,Customer_36,1081.0,2,0.846154,0.867822,1.0,0,0,0,1,0,0,1,0

In [27]:
df.to_csv("clean_customers.csv.", index=False)